---
kind: property
id: P:Autodesk.Revit.DB.Events.DocumentSaveToCentralProgressChangedEventArgs.SaveToCentralFinished
source: html/6a710cae-4279-e1d9-8c10-442ae55aa914.htm
---
# Autodesk.Revit.DB.Events.DocumentSaveToCentralProgressChangedEventArgs.SaveToCentralFinished Property

Indicates if current 'save to central' is finished.

## Syntax (C#)
```csharp
public bool SaveToCentralFinished { get; }
```